In [ ]:
pip install alpha_vantage

In [7]:
import pandas as pd

In [28]:
from alpha_vantage.timeseries import TimeSeries

In [29]:
with open("key.cred", "r") as cred_file:
    for line in cred_file:
        api_key = line.split("=")[1]

In [30]:
list_companies = ['AAPL','MSFT','AMZN','FB','BRK.B','JNJ','GOOG','JPM','V','PG']

In [31]:
# Chose your output format, or default to JSON (python dict)
ts = TimeSeries(api_key, output_format='pandas')

In [32]:
ts

In [33]:
data, metadata = ts.get_monthly(symbol="GOOG")

In [34]:
data

            1. open  2. high   3. low  4. close   5. volume
date
2020-04-13  1122.00  1225.57  1079.81   1217.56  17555788.0
2020-03-31  1351.61  1410.15  1013.54   1162.81  71398419.0
2020-02-28  1462.00  1532.11  1271.00   1339.33  37103140.0
2020-01-31  1341.55  1503.21  1341.55   1434.23  33406912.0
2019-12-31  1301.00  1365.00  1279.00   1337.02  27627707.0
...             ...      ...      ...       ...         ...
2014-08-29   570.40   587.34   560.00    571.60  27586000.0
2014-07-31   578.32   599.65   565.01    571.60  34516100.0
2014-06-30   560.70   582.45   538.75    575.28  37898400.0
2014-05-30   527.11   567.84   503.30    559.89  36527700.0
2014-04-30   558.71   604.83   502.80    526.66  67171200.0

[73 rows x 5 columns]

In [35]:
data['4. close']

date
2020-04-13    1217.56
2020-03-31    1162.81
2020-02-28    1339.33
2020-01-31    1434.23
2019-12-31    1337.02
               ...
2014-08-29     571.60
2014-07-31     571.60
2014-06-30     575.28
2014-05-30     559.89
2014-04-30     526.66
Name: 4. close, Length: 73, dtype: float64

In [36]:
type(data['4. close'])

pandas.core.series.Series

In [37]:
data2=pd.DataFrame(data['4. close'])

In [38]:
data2.rename(columns = {'4. close':'GOOG'}, inplace = True)
data2

               GOOG
date
2020-04-13  1217.56
2020-03-31  1162.81
2020-02-28  1339.33
2020-01-31  1434.23
2019-12-31  1337.02
...             ...
2014-08-29   571.60
2014-07-31   571.60
2014-06-30   575.28
2014-05-30   559.89
2014-04-30   526.66

[73 rows x 1 columns]

In [ ]:
for i in list_companies:
    data, metadata = ts.get_monthly(symbol=i)